*** api_gen/src/main.rs:7:19: replace < with <= in main

*** mutation diff:
--- api_gen/src/main.rs
+++ replace < with <= in main
@@ -1,15 +1,15 @@
 use std::{env, fs};
 use utoipa::OpenApi;
 use web_server::api::ApiDoc;
 
 fn main() {
     let args: Vec<String> = env::args().collect();
-    if args.len() < 2 {
+    if args.len() <= /* ~ changed by cargo-mutants ~ */ 2 {
         panic!("Usage: api_gen <output_file>");
     }
 
     let output_path = &args[1];
     let openapi = ApiDoc::openapi();
 
     match openapi.to_yaml() {
         Ok(yaml_desc) => {

*** result: Success
