*** web_server/src/background_scheduler.rs:69:37: replace += with *= in BackgroundScheduler::check_and_schedule_due_urls

*** mutation diff:
--- web_server/src/background_scheduler.rs
+++ replace += with *= in BackgroundScheduler::check_and_schedule_due_urls
@@ -61,17 +61,17 @@
 
             // Create scrape task
             let scrape_task = ScrapeTask::new(target_url, item_id, self.repo.clone());
 
             // Schedule the task
             match self.task_queue.schedule(scrape_task).await {
                 Ok(true) => {
                     info!("Scheduled refresh for URL ID: {}", item_id);
-                    scheduled_count += 1;
+                    scheduled_count *= /* ~ changed by cargo-mutants ~ */ 1;
 
                     // Update last_scraped timestamp to prevent immediate re-scheduling
                     if let Err(e) = self.repo.update_last_scraped(item_id).await {
                         error!(
                             "Failed to update last_scraped for URL ID {}: {}",
                             item_id, e
                         );
                     }

---- background_scheduler::tests::test_schedules_due_urls stdout ----

thread 'background_scheduler::tests::test_schedules_due_urls' (9865119) panicked at web_server/src/background_scheduler.rs:197:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    background_scheduler::tests::test_schedules_due_urls

test result: FAILED. 36 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
