*** web_server/src/main.rs:134:5: replace start_background_scheduler with ()

*** mutation diff:
--- web_server/src/main.rs
+++ replace start_background_scheduler with ()
@@ -126,18 +126,10 @@
         config,
     }
 }
 
 async fn start_background_scheduler(
     repo: Arc<dyn CommentsRepository>,
     task_queue: Arc<dyn TaskScheduler<ScrapeTask>>,
 ) {
-    let bg_scheduler = BackgroundScheduler::new(
-        repo.clone(),
-        task_queue.clone(),
-        Duration::from_secs(60), // Check every minute
-    );
-
-    tokio::spawn(async move {
-        bg_scheduler.run().await;
-    });
+    () /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
