*** web_server/src/scrape.rs:103:24: replace == with != in parse_root_comments

*** mutation diff:
--- web_server/src/scrape.rs
+++ replace == with != in parse_root_comments
@@ -95,17 +95,17 @@
 
     for tr in document.select(&tr_sel) {
         // Determine indent: root comments have width=0 on the indent img
         let is_root = tr
             .select(&ind_img_sel)
             .next()
             .and_then(|img| img.value().attr("width"))
             .and_then(|w| w.parse::<i32>().ok())
-            .map(|w| w == 0)
+            .map(|w| w != /* ~ changed by cargo-mutants ~ */ 0)
             .unwrap_or(true); // default to true if missing
 
         if !is_root {
             continue;
         }
 
         // Extract comment id from the age link (e.g., <span class="age"><a href="item?id=<COMMENT_ID>">...</a>)
         let id_opt = tr

---- scrape::tests::get_comments_skips_first_with_invalid_id_keeps_second stdout ----

thread 'scrape::tests::get_comments_skips_first_with_invalid_id_keeps_second' (9875944) panicked at web_server/src/scrape.rs:234:9:
assertion `left == right` failed: only the second valid root comment should remain
  left: 0
 right: 1

---- scrape::tests::get_comments_happy_path_parses_one_root_comment stdout ----

thread 'scrape::tests::get_comments_happy_path_parses_one_root_comment' (9875939) panicked at web_server/src/scrape.rs:188:9:
assertion `left == right` failed
  left: 999
 right: 12345

---- scrape::tests::get_comments_skips_first_with_empty_author_and_text stdout ----

thread 'scrape::tests::get_comments_skips_first_with_empty_author_and_text' (9875943) panicked at web_server/src/scrape.rs:264:9:
assertion `left == right` failed: only the second comment with text should remain
  left: 0
 right: 1

failures:
    scrape::tests::get_comments_happy_path_parses_one_root_comment
    scrape::tests::get_comments_skips_first_with_empty_author_and_text
    scrape::tests::get_comments_skips_first_with_invalid_id_keeps_second

test result: FAILED. 34 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
