*** web_server/src/scrape.rs:144:30: replace && with || in parse_root_comments

*** mutation diff:
--- web_server/src/scrape.rs
+++ replace && with || in parse_root_comments
@@ -136,17 +136,17 @@
             .unwrap_or_else(|| "".to_string());
 
         let text = tr
             .select(&text_sel)
             .next()
             .map(|t| t.text().collect::<String>())
             .unwrap_or_else(|| "".to_string());
 
-        if author.is_empty() && text.trim().is_empty() {
+        if author.is_empty() || /* ~ changed by cargo-mutants ~ */ text.trim().is_empty() {
             continue;
         }
 
         parsed_comments.push(CommentRecord {
             id,
             author,
             date,
             text,

*** result: Success
