*** web_server/src/scrape.rs:33:5: replace get_comments -> Result<Vec<CommentRecord>, ScrapeError> with Ok(vec![Default::default()])

*** mutation diff:
--- web_server/src/scrape.rs
+++ replace get_comments -> Result<Vec<CommentRecord>, ScrapeError> with Ok(vec![Default::default()])
@@ -25,35 +25,17 @@
                 f,
                 "invalid thread title: expected prefix 'Ask HN: What Are You Working On'"
             ),
         }
     }
 }
 
 pub(crate) async fn get_comments(url: &str) -> Result<Vec<CommentRecord>, ScrapeError> {
-    info!("Fetching URL: {}", url);
-    let html = match fetch_html(url).await {
-        Ok(h) => h,
-        Err(e) => {
-            return Err(HtmlFetchError(e));
-        }
-    };
-
-    // Validate thread title for real HN item pages only
-    if let Err(e) = validate_thread_title(&html) {
-        return Err(e);
-    }
-
-    info!("Parsing root comments...");
-    let comments = parse_root_comments(&html);
-    match comments {
-        Ok(c) => Ok(c),
-        Err(_e) => Err(ElementSelectorError()),
-    }
+    Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
 }
 
 async fn fetch_html(url: &str) -> Result<String, reqwest::Error> {
     let client = reqwest::Client::builder()
         .timeout(Duration::from_secs(20))
         .user_agent("rust-yscraper/0.1 (+https://news.ycombinator.com)")
         .build()?;

---- scrape::tests::get_comments_returns_err_on_connect_error stdout ----

thread 'scrape::tests::get_comments_returns_err_on_connect_error' (9868788) panicked at web_server/src/scrape.rs:195:9:
expected Err on connect error

---- scrape::tests::get_comments_returns_err_on_http_500 stdout ----

thread 'scrape::tests::get_comments_returns_err_on_http_500' (9868789) panicked at web_server/src/scrape.rs:187:9:
expected Err on non-200 status

---- scrape::tests::get_comments_happy_path_parses_one_root_comment stdout ----

thread 'scrape::tests::get_comments_happy_path_parses_one_root_comment' (9868786) panicked at web_server/src/scrape.rs:170:9:
assertion `left == right` failed
  left: 0
 right: 12345

failures:
    scrape::tests::get_comments_happy_path_parses_one_root_comment
    scrape::tests::get_comments_returns_empty_when_page_structure_unparsable_even_with_comment_like_section
    scrape::tests::get_comments_returns_err_on_connect_error
    scrape::tests::get_comments_returns_err_on_http_500
    scrape::tests::get_comments_skips_first_with_empty_author_and_text
    scrape::tests::get_comments_skips_first_with_invalid_id_keeps_second

test result: FAILED. 31 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
