*** web_server/src/scrape.rs:86:5: replace parse_root_comments -> Result<Vec<CommentRecord>, SelectorErrorKind<'_>> with Ok(vec![])

*** mutation diff:
--- web_server/src/scrape.rs
+++ replace parse_root_comments -> Result<Vec<CommentRecord>, SelectorErrorKind<'_>> with Ok(vec![])
@@ -78,88 +78,17 @@
         } else {
             warn!("Invalid thread title: {}", title_text);
         }
     }
     Err(InvalidThreadTitle())
 }
 
 fn parse_root_comments(html: &str) -> Result<Vec<CommentRecord>, SelectorErrorKind<'_>> {
-    let document = Html::parse_document(html);
-    let tr_sel = Selector::parse("tr.athing.comtr")?;
-    let ind_img_sel = Selector::parse("td.ind img")?;
-    let author_sel = Selector::parse("a.hnuser")?;
-    let age_sel = Selector::parse("span.age")?;
-    let age_link_sel = Selector::parse("span.age a")?;
-    let text_sel = Selector::parse(".comment")?;
-
-    let mut parsed_comments = Vec::new();
-
-    for tr in document.select(&tr_sel) {
-        // Determine indent: root comments have width=0 on the indent img
-        let is_root = tr
-            .select(&ind_img_sel)
-            .next()
-            .and_then(|img| img.value().attr("width"))
-            .and_then(|w| w.parse::<i32>().ok())
-            .map(|w| w == 0)
-            .unwrap_or(true); // default to true if missing
-
-        if !is_root {
-            continue;
-        }
-
-        // Extract comment id from the age link (e.g., <span class="age"><a href="item?id=<COMMENT_ID>">...</a>)
-        let id_opt = tr
-            .select(&age_link_sel)
-            .next()
-            .and_then(|a| a.value().attr("href"))
-            .and_then(extract_item_id_from_url);
-
-        let id = match id_opt {
-            Some(v) => v,
-            None => {
-                warn!("Skipping a root comment without a parsable reply id");
-                continue;
-            }
-        };
-
-        let author = tr
-            .select(&author_sel)
-            .next()
-            .map(|a| a.text().collect::<String>())
-            .unwrap_or_else(|| "".to_string());
-
-        let date = tr
-            .select(&age_sel)
-            .next()
-            .and_then(|span| span.value().attr("title").map(|s| s.to_string()))
-            .or_else(|| tr.select(&age_sel).next().map(|s| s.text().collect()))
-            .unwrap_or_else(|| "".to_string());
-
-        let text = tr
-            .select(&text_sel)
-            .next()
-            .map(|t| t.text().collect::<String>())
-            .unwrap_or_else(|| "".to_string());
-
-        if author.is_empty() && text.trim().is_empty() {
-            continue;
-        }
-
-        parsed_comments.push(CommentRecord {
-            id,
-            author,
-            date,
-            text,
-            tags: vec![],
-        });
-    }
-
-    Ok(parsed_comments)
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::get_comments;
     use wiremock::matchers::{method, path};
     use wiremock::{Mock, MockServer, ResponseTemplate};

---- scrape::tests::get_comments_happy_path_parses_one_root_comment stdout ----

thread 'scrape::tests::get_comments_happy_path_parses_one_root_comment' (9873489) panicked at web_server/src/scrape.rs:115:9:
assertion `left == right` failed: should only include root comments
  left: 0
 right: 1

---- scrape::tests::get_comments_skips_first_with_invalid_id_keeps_second stdout ----

thread 'scrape::tests::get_comments_skips_first_with_invalid_id_keeps_second' (9873494) panicked at web_server/src/scrape.rs:163:9:
assertion `left == right` failed: only the second valid root comment should remain
  left: 0
 right: 1

---- scrape::tests::get_comments_skips_first_with_empty_author_and_text stdout ----

thread 'scrape::tests::get_comments_skips_first_with_empty_author_and_text' (9873493) panicked at web_server/src/scrape.rs:193:9:
assertion `left == right` failed: only the second comment with text should remain
  left: 0
 right: 1

failures:
    scrape::tests::get_comments_happy_path_parses_one_root_comment
    scrape::tests::get_comments_skips_first_with_empty_author_and_text
    scrape::tests::get_comments_skips_first_with_invalid_id_keeps_second

test result: FAILED. 34 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
