*** web_server/src/scrape_task.rs:100:44: replace += with -= in <impl TaskQueueProcessor for ScrapeTask>::execute

*** mutation diff:
--- web_server/src/scrape_task.rs
+++ replace += with -= in <impl TaskQueueProcessor for ScrapeTask>::execute
@@ -92,17 +92,17 @@
             Ok(comments) => {
                 info!("Parsed {} root comments", comments.len());
 
                 let batches: Vec<Vec<CommentRecord>> = create_batches(&comments, 10);
                 let mut total_inserted = 0usize;
                 for batch in batches.iter() {
                     match self.repo.upsert_comments(batch, self.url_id).await {
                         Ok(n) => {
-                            total_inserted += n;
+                            total_inserted -= /* ~ changed by cargo-mutants ~ */ n;
                             info!("Inserted {} comments into the database", n);
                         }
                         Err(e) => error!("Failed to insert comments: {}", e),
                     }
                 }
 
                 info!("Scraping complete; {} comments inserted", total_inserted);

*** result: Success
