*** web_server/src/scrape_task.rs:30:9: replace ScrapeTask::url_id -> i64 with 1

*** mutation diff:
--- web_server/src/scrape_task.rs
+++ replace ScrapeTask::url_id -> i64 with 1
@@ -22,17 +22,17 @@
         ScrapeTask {
             url,
             url_id,
             repo: comments_repo.clone(),
         }
     }
 
     pub fn url_id(&self) -> i64 {
-        self.url_id
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn url(&self) -> &str {
         &self.url
     }
 }
 
 impl Eq for ScrapeTask {}

---- background_scheduler::tests::test_schedules_due_urls stdout ----

thread 'background_scheduler::tests::test_schedules_due_urls' (9880423) panicked at web_server/src/background_scheduler.rs:201:9:
assertion `left == right` failed
  left: 1
 right: 123

failures:
    background_scheduler::tests::test_schedules_due_urls

test result: FAILED. 36 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
