*** web_server/src/scrape_task.rs:42:21: replace == with != in <impl PartialEq for ScrapeTask>::eq

*** mutation diff:
--- web_server/src/scrape_task.rs
+++ replace == with != in <impl PartialEq for ScrapeTask>::eq
@@ -34,17 +34,17 @@
         &self.url
     }
 }
 
 impl Eq for ScrapeTask {}
 
 impl PartialEq for ScrapeTask {
     fn eq(&self, other: &Self) -> bool {
-        self.url_id == other.url_id && self.url == other.url
+        self.url_id != /* ~ changed by cargo-mutants ~ */ other.url_id && self.url == other.url
     }
 }
 
 impl Hash for ScrapeTask {
     fn hash<H: Hasher>(&self, state: &mut H) {
         self.url_id.hash(state);
         self.url.hash(state);
     }

---- api::comments::tests::schedules_task_and_returns_scheduled stdout ----

thread 'api::comments::tests::schedules_task_and_returns_scheduled' (9889386) panicked at web_server/src/api/comments.rs:398:9:
ScrapeTask fields should match

---- scrape_task::tests_task_hashing::hashset_deduplicates_equal_tasks stdout ----

thread 'scrape_task::tests_task_hashing::hashset_deduplicates_equal_tasks' (9889405) panicked at web_server/src/scrape_task.rs:181:9:
assertion `left == right` failed: HashSet should deduplicate equal ScrapeTask items
  left: 2
 right: 1

failures:
    api::comments::tests::schedules_task_and_returns_scheduled
    scrape_task::tests_task_hashing::hashset_deduplicates_equal_tasks

test result: FAILED. 35 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
