*** web_server/src/scrape_task.rs:42:37: replace && with || in <impl PartialEq for ScrapeTask>::eq

*** mutation diff:
--- web_server/src/scrape_task.rs
+++ replace && with || in <impl PartialEq for ScrapeTask>::eq
@@ -34,17 +34,17 @@
         &self.url
     }
 }
 
 impl Eq for ScrapeTask {}
 
 impl PartialEq for ScrapeTask {
     fn eq(&self, other: &Self) -> bool {
-        self.url_id == other.url_id && self.url == other.url
+        self.url_id == other.url_id || /* ~ changed by cargo-mutants ~ */ self.url == other.url
     }
 }
 
 impl Hash for ScrapeTask {
     fn hash<H: Hasher>(&self, state: &mut H) {
         self.url_id.hash(state);
         self.url.hash(state);
     }

*** result: Success
