*** web_server/src/scrape_task.rs:42:9: replace <impl PartialEq for ScrapeTask>::eq -> bool with true

*** mutation diff:
--- web_server/src/scrape_task.rs
+++ replace <impl PartialEq for ScrapeTask>::eq -> bool with true
@@ -34,17 +34,17 @@
         &self.url
     }
 }
 
 impl Eq for ScrapeTask {}
 
 impl PartialEq for ScrapeTask {
     fn eq(&self, other: &Self) -> bool {
-        self.url_id == other.url_id && self.url == other.url
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Hash for ScrapeTask {
     fn hash<H: Hasher>(&self, state: &mut H) {
         self.url_id.hash(state);
         self.url.hash(state);
     }

*** result: Success
