*** web_server/src/scrape_task.rs:48:9: replace <impl Hash for ScrapeTask>::hash with ()

*** mutation diff:
--- web_server/src/scrape_task.rs
+++ replace <impl Hash for ScrapeTask>::hash with ()
@@ -40,18 +40,17 @@
 impl PartialEq for ScrapeTask {
     fn eq(&self, other: &Self) -> bool {
         self.url_id == other.url_id && self.url == other.url
     }
 }
 
 impl Hash for ScrapeTask {
     fn hash<H: Hasher>(&self, state: &mut H) {
-        self.url_id.hash(state);
-        self.url.hash(state);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Display for ScrapeTask {
     fn fmt(&self, formatter: &mut Formatter<'_>) -> std::fmt::Result {
         writeln!(formatter, "\nurl id: {}\nurl: {}", self.url_id, self.url)
     }
 }

*** result: Success
