*** web_server/src/scrape_task.rs:55:9: replace <impl Display for ScrapeTask>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- web_server/src/scrape_task.rs
+++ replace <impl Display for ScrapeTask>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -47,17 +47,17 @@
     fn hash<H: Hasher>(&self, state: &mut H) {
         self.url_id.hash(state);
         self.url.hash(state);
     }
 }
 
 impl Display for ScrapeTask {
     fn fmt(&self, formatter: &mut Formatter<'_>) -> std::fmt::Result {
-        writeln!(formatter, "\nurl id: {}\nurl: {}", self.url_id, self.url)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug)]
 pub enum ScrapeTaskError {
     DatabaseError(sqlx::Error),
     ScrapingError(ScrapeError),
 }

*** result: Success
