*** web_server/src/scrape_task.rs:87:9: replace <impl TaskQueueProcessor for ScrapeTask>::execute -> Result<(), ScrapeTaskError> with Ok(())

*** mutation diff:
--- web_server/src/scrape_task.rs
+++ replace <impl TaskQueueProcessor for ScrapeTask>::execute -> Result<(), ScrapeTaskError> with Ok(())
@@ -79,47 +79,17 @@
     }
 }
 
 #[async_trait]
 impl TaskQueueProcessor for ScrapeTask {
     type ProcessorError = ScrapeTaskError;
 
     async fn execute(&self) -> Result<(), ScrapeTaskError> {
-        info!("Executing Scrape TASK.");
-
-        info!("/scrape called; starting scraping for {}", self.url);
-        let comments_retrieval = get_comments(&self.url).await;
-        match comments_retrieval {
-            Ok(comments) => {
-                info!("Parsed {} root comments", comments.len());
-
-                let batches: Vec<Vec<CommentRecord>> = create_batches(&comments, 10);
-                let mut total_inserted = 0usize;
-                for batch in batches.iter() {
-                    match self.repo.upsert_comments(batch, self.url_id).await {
-                        Ok(n) => {
-                            total_inserted += n;
-                            info!("Inserted {} comments into the database", n);
-                        }
-                        Err(e) => error!("Failed to insert comments: {}", e),
-                    }
-                }
-
-                info!("Scraping complete; {} comments inserted", total_inserted);
-
-                // Update last_scraped timestamp for scheduling purposes
-                if let Err(e) = self.repo.update_last_scraped(self.url_id).await {
-                    error!("Failed to update last_scraped timestamp: {}", e);
-                }
-            }
-            Err(error) => return Err(ScrapeTaskError::ScrapingError(error)),
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests_task_hashing {
     use super::ScrapeTask;
     use crate::db::comments_repository::{CommentsRepository, DbCommentRow};
     use async_trait::async_trait;

*** result: Success
