*** api_gen/src/main.rs:6:5: replace main with ()

*** mutation diff:
--- api_gen/src/main.rs
+++ replace main with ()
@@ -1,21 +1,7 @@
 use std::{env, fs};
 use utoipa::OpenApi;
 use web_server::api::ApiDoc;
 
 fn main() {
-    let args: Vec<String> = env::args().collect();
-    if args.len() < 2 {
-        panic!("Usage: api_gen <output_file>");
-    }
-
-    let output_path = &args[1];
-    let openapi = ApiDoc::openapi();
-
-    match openapi.to_yaml() {
-        Ok(yaml_desc) => {
-            println!("OpenAPI spec successfully generated at: {}", output_path);
-            fs::write(output_path, yaml_desc).unwrap();
-        }
-        Err(e) => panic!("Failed to write OpenAPI spec: {}", e),
-    };
+    () /* ~ changed by cargo-mutants ~ */
 }
\ No newline at end of file

*** result: Success
