*** web_server/src/background_scheduler.rs:55:9: replace BackgroundScheduler::check_and_schedule_due_urls -> Result<usize, Box<dyn std::error::Error +Send +Sync>> with Ok(0)

*** mutation diff:
--- web_server/src/background_scheduler.rs
+++ replace BackgroundScheduler::check_and_schedule_due_urls -> Result<usize, Box<dyn std::error::Error +Send +Sync>> with Ok(0)
@@ -47,50 +47,17 @@
             }
         }
     }
 
     // REFACTOR: Return a specific error type.
     async fn check_and_schedule_due_urls(
         &self,
     ) -> Result<usize, Box<dyn std::error::Error + Send + Sync>> {
-        let due_urls = self.repo.get_urls_due_for_refresh().await?;
-        let mut scheduled_count = 0;
-
-        for url_row in due_urls {
-            let target_url = url_row.url.clone();
-            let item_id = url_row.id;
-
-            // Create scrape task
-            let scrape_task = ScrapeTask::new(target_url, item_id, self.repo.clone());
-
-            // Schedule the task
-            match self.task_queue.schedule(scrape_task).await {
-                Ok(true) => {
-                    info!("Scheduled refresh for URL ID: {}", item_id);
-                    scheduled_count += 1;
-
-                    // Update last_scraped timestamp to prevent immediate re-scheduling
-                    if let Err(e) = self.repo.update_last_scraped(item_id).await {
-                        error!(
-                            "Failed to update last_scraped for URL ID {}: {}",
-                            item_id, e
-                        );
-                    }
-                }
-                Ok(false) => {
-                    info!("Refresh for URL ID {} already scheduled", item_id);
-                }
-                Err(e) => {
-                    error!("Failed to schedule refresh for URL ID {}: {}", item_id, e);
-                }
-            }
-        }
-
-        Ok(scheduled_count)
+        Ok(0) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::db::comments_repository::ScheduledUrl;
     use async_trait::async_trait;

---- background_scheduler::tests::test_schedules_due_urls stdout ----

thread 'background_scheduler::tests::test_schedules_due_urls' (10064920) panicked at web_server/src/background_scheduler.rs:164:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    background_scheduler::tests::test_schedules_due_urls

test result: FAILED. 43 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
