*** web_server/src/scrape.rs:104:12: delete ! in parse_root_comments

*** mutation diff:
--- web_server/src/scrape.rs
+++ delete ! in parse_root_comments
@@ -96,17 +96,17 @@
         let is_root = tr
             .select(&ind_img_sel)
             .next()
             .and_then(|img| img.value().attr("width"))
             .and_then(|w| w.parse::<i32>().ok())
             .map(|w| w == 0)
             .unwrap_or(true); // default to true if missing
 
-        if !is_root {
+        if  /* ~ changed by cargo-mutants ~ */is_root {
             continue;
         }
 
         // Extract comment id from the age link (e.g., <span class="age"><a href="item?id=<COMMENT_ID>">...</a>)
         let id_opt = tr
             .select(&age_link_sel)
             .next()
             .and_then(|a| a.value().attr("href"))

---- scrape::tests::get_comments_skips_first_with_empty_author_and_text stdout ----

thread 'scrape::tests::get_comments_skips_first_with_empty_author_and_text' (10079893) panicked at web_server/src/scrape.rs:262:9:
assertion `left == right` failed: only the second comment with text should remain
  left: 0
 right: 1

---- scrape::tests::get_comments_skips_first_with_invalid_id_keeps_second stdout ----

thread 'scrape::tests::get_comments_skips_first_with_invalid_id_keeps_second' (10079895) panicked at web_server/src/scrape.rs:232:9:
assertion `left == right` failed: only the second valid root comment should remain
  left: 0
 right: 1

---- scrape::tests::get_comments_happy_path_parses_one_root_comment stdout ----

thread 'scrape::tests::get_comments_happy_path_parses_one_root_comment' (10079887) panicked at web_server/src/scrape.rs:186:9:
assertion `left == right` failed
  left: 999
 right: 12345

failures:
    scrape::tests::get_comments_happy_path_parses_one_root_comment
    scrape::tests::get_comments_skips_first_with_empty_author_and_text
    scrape::tests::get_comments_skips_first_with_invalid_id_keeps_second

test result: FAILED. 41 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
