*** web_server/src/scrape.rs:33:5: replace get_comments -> Result<Vec<CommentRecord>, ScrapeError> with Ok(vec![])

*** mutation diff:
--- web_server/src/scrape.rs
+++ replace get_comments -> Result<Vec<CommentRecord>, ScrapeError> with Ok(vec![])
@@ -25,33 +25,17 @@
                 f,
                 "invalid thread title: expected prefix 'Ask HN: What Are You Working On'"
             ),
         }
     }
 }
 
 pub(crate) async fn get_comments(url: &str) -> Result<Vec<CommentRecord>, ScrapeError> {
-    info!("Fetching URL: {}", url);
-    let html = match fetch_html(url).await {
-        Ok(h) => h,
-        Err(e) => {
-            return Err(HtmlFetchError(e));
-        }
-    };
-
-    // Validate thread title for real HN item pages only
-    validate_thread_title(&html)?;
-
-    info!("Parsing root comments...");
-    let comments = parse_root_comments(&html);
-    match comments {
-        Ok(c) => Ok(c),
-        Err(_e) => Err(ElementSelectorError()),
-    }
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 async fn fetch_html(url: &str) -> Result<String, reqwest::Error> {
     let client = reqwest::Client::builder()
         .timeout(Duration::from_secs(20))
         .user_agent("rust-yscraper/0.1 (+https://news.ycombinator.com)")
         .build()?;

---- scrape::tests::get_comments_returns_err_on_connect_error stdout ----

thread 'scrape::tests::get_comments_returns_err_on_connect_error' (10071022) panicked at web_server/src/scrape.rs:195:9:
expected Err on connect error

---- scrape::tests::get_comments_returns_err_on_http_500 stdout ----

thread 'scrape::tests::get_comments_returns_err_on_http_500' (10071023) panicked at web_server/src/scrape.rs:187:9:
expected Err on non-200 status

---- scrape::tests::get_comments_skips_first_with_empty_author_and_text stdout ----

thread 'scrape::tests::get_comments_skips_first_with_empty_author_and_text' (10071024) panicked at web_server/src/scrape.rs:246:9:
assertion `left == right` failed: only the second comment with text should remain
  left: 0
 right: 1

failures:
    scrape::tests::get_comments_happy_path_parses_one_root_comment
    scrape::tests::get_comments_returns_err_on_connect_error
    scrape::tests::get_comments_returns_err_on_http_500
    scrape::tests::get_comments_skips_first_with_empty_author_and_text
    scrape::tests::get_comments_skips_first_with_invalid_id_keeps_second

test result: FAILED. 39 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
