*** web_server/src/scrape.rs:53:5: replace fetch_html -> Result<String, reqwest::Error> with Ok(String::new())

*** mutation diff:
--- web_server/src/scrape.rs
+++ replace fetch_html -> Result<String, reqwest::Error> with Ok(String::new())
@@ -45,25 +45,17 @@
     let comments = parse_root_comments(&html);
     match comments {
         Ok(c) => Ok(c),
         Err(_e) => Err(ElementSelectorError()),
     }
 }
 
 async fn fetch_html(url: &str) -> Result<String, reqwest::Error> {
-    let client = reqwest::Client::builder()
-        .timeout(Duration::from_secs(20))
-        .user_agent("rust-yscraper/0.1 (+https://news.ycombinator.com)")
-        .build()?;
-
-    let resp = client.get(url).send().await?;
-
-    let valid_response = resp.error_for_status()?;
-    valid_response.text().await
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 const THREAD_PREFIX: &str = "Ask HN: What Are You Working On";
 
 fn validate_thread_title(html: &str) -> Result<(), ScrapeError> {
     let document = Html::parse_document(html);
     let tl_sel = Selector::parse("span.titleline").map_err(|_| ElementSelectorError())?;
     if let Some(span) = document.select(&tl_sel).next() {

---- scrape::tests::get_comments_skips_first_with_empty_author_and_text stdout ----

thread 'scrape::tests::get_comments_skips_first_with_empty_author_and_text' (10073167) panicked at web_server/src/scrape.rs:252:9:
expected Ok, got Err(InvalidThreadTitle)

---- scrape::tests::get_comments_skips_first_with_invalid_id_keeps_second stdout ----

thread 'scrape::tests::get_comments_skips_first_with_invalid_id_keeps_second' (10073169) panicked at web_server/src/scrape.rs:222:9:
expected Ok, got Err(InvalidThreadTitle)

---- scrape::tests::get_comments_returns_empty_when_page_structure_unparsable_even_with_comment_like_section stdout ----

thread 'scrape::tests::get_comments_returns_empty_when_page_structure_unparsable_even_with_comment_like_section' (10073164) panicked at web_server/src/scrape.rs:283:9:
expected Ok, got Err(InvalidThreadTitle)

failures:
    scrape::tests::get_comments_happy_path_parses_one_root_comment
    scrape::tests::get_comments_returns_empty_when_page_structure_unparsable_even_with_comment_like_section
    scrape::tests::get_comments_skips_first_with_empty_author_and_text
    scrape::tests::get_comments_skips_first_with_invalid_id_keeps_second

test result: FAILED. 40 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
