*** web_server/src/scrape_task.rs:22:9: replace <impl std::fmt::Debug for ScrapeTask>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- web_server/src/scrape_task.rs
+++ replace <impl std::fmt::Debug for ScrapeTask>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -14,21 +14,17 @@
 pub struct ScrapeTask {
     url: String,
     url_id: i64,
     repo: Arc<dyn CommentsRepository>,
 }
 
 impl std::fmt::Debug for ScrapeTask {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        f.debug_struct("ScrapeTask")
-            .field("url", &self.url)
-            .field("url_id", &self.url_id)
-            .field("repo", &"<CommentsRepository>")
-            .finish()
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl ScrapeTask {
     pub fn new(url: String, url_id: i64, comments_repo: Arc<dyn CommentsRepository>) -> Self {
         ScrapeTask {
             url,
             url_id,

*** result: Success
