*** web_server/src/scrape_task.rs:44:9: replace ScrapeTask::url -> &str with "xyzzy"

*** mutation diff:
--- web_server/src/scrape_task.rs
+++ replace ScrapeTask::url -> &str with "xyzzy"
@@ -36,17 +36,17 @@
         }
     }
 
     pub fn url_id(&self) -> i64 {
         self.url_id
     }
 
     pub fn url(&self) -> &str {
-        &self.url
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Eq for ScrapeTask {}
 
 impl PartialEq for ScrapeTask {
     fn eq(&self, other: &Self) -> bool {
         self.url == other.url && self.url_id == other.url_id

*** result: Success
