*** web_server/src/scrape_task.rs:52:31: replace && with || in <impl PartialEq for ScrapeTask>::eq

*** mutation diff:
--- web_server/src/scrape_task.rs
+++ replace && with || in <impl PartialEq for ScrapeTask>::eq
@@ -44,17 +44,17 @@
         &self.url
     }
 }
 
 impl Eq for ScrapeTask {}
 
 impl PartialEq for ScrapeTask {
     fn eq(&self, other: &Self) -> bool {
-        self.url == other.url && self.url_id == other.url_id
+        self.url == other.url || /* ~ changed by cargo-mutants ~ */ self.url_id == other.url_id
     }
 }
 
 impl Hash for ScrapeTask {
     fn hash<H: Hasher>(&self, state: &mut H) {
         self.url.hash(state);
         self.url_id.hash(state);
     }

---- scrape_task::tests_task_hashing::test_inequality_different_url_same_id stdout ----

thread 'scrape_task::tests_task_hashing::test_inequality_different_url_same_id' (10093340) panicked at web_server/src/scrape_task.rs:264:9:
assertion `left != right` failed: Tasks with different URL but same url_id should not be equal
  left: ScrapeTask { url: "https://example.com/item/1", url_id: 1, repo: "<CommentsRepository>" }
 right: ScrapeTask { url: "https://example.com/item/2", url_id: 1, repo: "<CommentsRepository>" }

---- scrape_task::tests_task_hashing::test_inequality_same_url_different_id stdout ----

thread 'scrape_task::tests_task_hashing::test_inequality_same_url_different_id' (10093341) panicked at web_server/src/scrape_task.rs:253:9:
assertion `left != right` failed: Tasks with same URL but different url_id should not be equal
  left: ScrapeTask { url: "https://example.com/item/1", url_id: 1, repo: "<CommentsRepository>" }
 right: ScrapeTask { url: "https://example.com/item/1", url_id: 999, repo: "<CommentsRepository>" }

failures:
    scrape_task::tests_task_hashing::test_inequality_different_url_same_id
    scrape_task::tests_task_hashing::test_inequality_same_url_different_id

test result: FAILED. 42 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
