*** web_server/src/scrape_task.rs:52:46: replace == with != in <impl PartialEq for ScrapeTask>::eq

*** mutation diff:
--- web_server/src/scrape_task.rs
+++ replace == with != in <impl PartialEq for ScrapeTask>::eq
@@ -44,17 +44,17 @@
         &self.url
     }
 }
 
 impl Eq for ScrapeTask {}
 
 impl PartialEq for ScrapeTask {
     fn eq(&self, other: &Self) -> bool {
-        self.url == other.url && self.url_id == other.url_id
+        self.url == other.url && self.url_id != /* ~ changed by cargo-mutants ~ */ other.url_id
     }
 }
 
 impl Hash for ScrapeTask {
     fn hash<H: Hasher>(&self, state: &mut H) {
         self.url.hash(state);
         self.url_id.hash(state);
     }

---- scrape_task::tests_task_hashing::hashset_deduplicates_equal_tasks stdout ----

thread 'scrape_task::tests_task_hashing::hashset_deduplicates_equal_tasks' (10095775) panicked at web_server/src/scrape_task.rs:200:9:
assertion `left == right` failed: HashSet should deduplicate equal ScrapeTask items
  left: 2
 right: 1

---- api::comments::tests::schedules_task_and_returns_scheduled stdout ----

thread 'api::comments::tests::schedules_task_and_returns_scheduled' (10095756) panicked at web_server/src/api/comments.rs:398:9:
ScrapeTask fields should match

---- scrape_task::tests_task_hashing::test_equality_same_url_and_id stdout ----

thread 'scrape_task::tests_task_hashing::test_equality_same_url_and_id' (10095779) panicked at web_server/src/scrape_task.rs:245:9:
assertion `left == right` failed: Tasks with same URL and url_id should be equal
  left: ScrapeTask { url: "https://example.com/item/1", url_id: 1, repo: "<CommentsRepository>" }
 right: ScrapeTask { url: "https://example.com/item/1", url_id: 1, repo: "<CommentsRepository>" }

failures:
    api::comments::tests::schedules_task_and_returns_scheduled
    scrape_task::tests_task_hashing::hashset_deduplicates_equal_tasks
    scrape_task::tests_task_hashing::test_equality_same_url_and_id
    scrape_task::tests_task_hashing::test_inequality_same_url_different_id

test result: FAILED. 40 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
