*** web_server/src/scrape_task.rs:52:9: replace <impl PartialEq for ScrapeTask>::eq -> bool with true

*** mutation diff:
--- web_server/src/scrape_task.rs
+++ replace <impl PartialEq for ScrapeTask>::eq -> bool with true
@@ -44,17 +44,17 @@
         &self.url
     }
 }
 
 impl Eq for ScrapeTask {}
 
 impl PartialEq for ScrapeTask {
     fn eq(&self, other: &Self) -> bool {
-        self.url == other.url && self.url_id == other.url_id
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Hash for ScrapeTask {
     fn hash<H: Hasher>(&self, state: &mut H) {
         self.url.hash(state);
         self.url_id.hash(state);
     }

---- scrape_task::tests_task_hashing::test_inequality_same_url_different_id stdout ----

thread 'scrape_task::tests_task_hashing::test_inequality_same_url_different_id' (10090834) panicked at web_server/src/scrape_task.rs:253:9:
assertion `left != right` failed: Tasks with same URL but different url_id should not be equal
  left: ScrapeTask { url: "https://example.com/item/1", url_id: 1, repo: "<CommentsRepository>" }
 right: ScrapeTask { url: "https://example.com/item/1", url_id: 999, repo: "<CommentsRepository>" }

---- scrape_task::tests_task_hashing::test_inequality_different_url_and_id stdout ----

thread 'scrape_task::tests_task_hashing::test_inequality_different_url_and_id' (10090832) panicked at web_server/src/scrape_task.rs:275:9:
assertion `left != right` failed: Tasks with different URL and url_id should not be equal
  left: ScrapeTask { url: "https://example.com/item/1", url_id: 1, repo: "<CommentsRepository>" }
 right: ScrapeTask { url: "https://example.com/item/2", url_id: 999, repo: "<CommentsRepository>" }

---- scrape_task::tests_task_hashing::test_inequality_different_url_same_id stdout ----

thread 'scrape_task::tests_task_hashing::test_inequality_different_url_same_id' (10090833) panicked at web_server/src/scrape_task.rs:264:9:
assertion `left != right` failed: Tasks with different URL but same url_id should not be equal
  left: ScrapeTask { url: "https://example.com/item/1", url_id: 1, repo: "<CommentsRepository>" }
 right: ScrapeTask { url: "https://example.com/item/2", url_id: 1, repo: "<CommentsRepository>" }

failures:
    scrape_task::tests_task_hashing::test_inequality_different_url_and_id
    scrape_task::tests_task_hashing::test_inequality_different_url_same_id
    scrape_task::tests_task_hashing::test_inequality_same_url_different_id

test result: FAILED. 41 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
