*** web_server/src/scrape_task.rs:58:9: replace <impl Hash for ScrapeTask>::hash with ()

*** mutation diff:
--- web_server/src/scrape_task.rs
+++ replace <impl Hash for ScrapeTask>::hash with ()
@@ -50,18 +50,17 @@
 impl PartialEq for ScrapeTask {
     fn eq(&self, other: &Self) -> bool {
         self.url == other.url && self.url_id == other.url_id
     }
 }
 
 impl Hash for ScrapeTask {
     fn hash<H: Hasher>(&self, state: &mut H) {
-        self.url.hash(state);
-        self.url_id.hash(state);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Display for ScrapeTask {
     fn fmt(&self, formatter: &mut Formatter<'_>) -> std::fmt::Result {
         writeln!(formatter, "\nurl id: {}\nurl: {}", self.url_id, self.url)
     }
 }

---- scrape_task::tests_task_hashing::test_hash_difference_same_url_different_id stdout ----

thread 'scrape_task::tests_task_hashing::test_hash_difference_same_url_different_id' (10097081) panicked at web_server/src/scrape_task.rs:311:9:
assertion `left != right` failed: Same URL but different url_id should have different hashes
  left: 15130871412783076140
 right: 15130871412783076140

---- scrape_task::tests_task_hashing::test_hash_difference_different_url_same_id stdout ----

thread 'scrape_task::tests_task_hashing::test_hash_difference_different_url_same_id' (10097080) panicked at web_server/src/scrape_task.rs:331:9:
assertion `left != right` failed: Different URL but same url_id should have different hashes
  left: 15130871412783076140
 right: 15130871412783076140

failures:
    scrape_task::tests_task_hashing::test_hash_difference_different_url_same_id
    scrape_task::tests_task_hashing::test_hash_difference_same_url_different_id

test result: FAILED. 42 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
