*** web_server/src/scrape_task.rs:77:9: replace <impl Error for ScrapeTaskError>::cause -> Option<&dyn Error> with None

*** mutation diff:
--- web_server/src/scrape_task.rs
+++ replace <impl Error for ScrapeTaskError>::cause -> Option<&dyn Error> with None
@@ -69,20 +69,17 @@
 #[derive(Debug)]
 pub enum ScrapeTaskError {
     DatabaseError(sqlx::Error),
     ScrapingError(ScrapeError),
 }
 
 impl Error for ScrapeTaskError {
     fn cause(&self) -> Option<&dyn Error> {
-        match self {
-            ScrapeTaskError::DatabaseError(e) => Some(e),
-            ScrapeTaskError::ScrapingError(e) => Some(e),
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 impl Display for ScrapeTaskError {
     fn fmt(&self, f: &mut Formatter<'_>) -> std::fmt::Result {
         match self {
             ScrapeTaskError::DatabaseError(e) => write!(f, "{}", e),
             ScrapeTaskError::ScrapingError(e) => write!(f, "{}", e),
         }

*** result: Success
